UNFCOPY.саУНФУправлениеАссортиментом/src/DataProcessors/ПечатьЛистаЗагрузки/ПечатьЛистаЗагрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьЛистаЗагрузки</name>
</mdclass:DataProcessor>

UNFCOPY.саУНФУправлениеАссортиментом/src/InformationRegisters/СотрудникиПользователя/СотрудникиПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="757dfba3-fc4f-4273-83b6-a8ae50a685e2">
  <name>СотрудникиПользователя</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="310d5373-bd0f-4c07-9dad-cbc27343c44c">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a308f209-e995-4560-a1a3-9c98ac77dbd3">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

UNFCOPY.саУНФУправлениеАссортиментом/src/Documents/ПеремещениеЗапасов/ПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c63e7296-8bd5-4572-b1ca-d62e9d4681b3">
  <name>ПеремещениеЗапасов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>СтруктурнаяЕдиницаРеципиент</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСнабжения</name>
    <type>
      <types>DocumentRef.саУНФ_ЗаказСнабжения</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="2f9254d3-924b-4caf-b47a-628781e5adb8">
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9ed471c0-7303-4652-b434-1027727c5b67">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2ea1fc21-bf58-41ff-9b62-421a3ffc846f">
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f202ea25-5f08-454c-bcd4-d55a2675affb">
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="93db1c83-ec44-4e17-a675-b53a1859d1b5">
    <name>ЯчейкаПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="739c93ad-81cc-401b-95f3-ec81b0e6ca07">
    <name>ЗаказПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aa5b33fe-cf43-49b9-b5ea-b7826671f562">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b99b4c3c-b6c9-4d5b-a573-3969efe6420f">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6fcc9ac8-8471-48b7-a809-243a1da6d33e">
    <name>СчетЗатрат</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89592531-f8c0-4bcf-b2f0-fc6a8387e335">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="743962e9-651e-42ac-9605-ee91b64795aa">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="259b7032-9476-4cfe-97a1-7a2faa232a3c">
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9627732b-060e-4169-a38e-bd066c80b5bd">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>саУНФ_МаршрутныйЛист</name>
    <type>
      <types>DocumentRef.МаршрутныйЛист</types>
    </type>
  </attributes>
  <attributes>
    <name>ПАК_МаршрутныйЛист</name>
    <type>
      <types>DocumentRef.ПАК_МаршрутныйЛист</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаТариф</name>
    <type>
      <types>CatalogRef.ЗоныТарифыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>саУНФ_Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>саУНФ_СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>саУНФ_НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>саУНФ_СуммаСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонКурьера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСборки</name>
    <type>
      <types>EnumRef.СостояниеСборки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузкиАвтомобиля</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="bc903c70-92bd-4b1f-98b2-ad50b8bb044c">
    <name>Автомобиль</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОВодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВодительПосторонний</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="2e1d10ce-4594-477f-ace1-dcad764157ce">
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9c8e5c4e-d9b1-415a-8d9c-77359fe3b5f3">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c5cd63d4-614d-4f48-8364-002d2b3b99d3">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="57001e53-e9c9-434b-8225-eaf7c072766b">
      <name>СтранаПроисхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f890776d-32fc-4a55-888f-ab5f04372bb2">
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0ab759b1-5453-423a-9808-dae7f0d62e7d">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="594d5818-02d3-4902-811e-e8692cc12658">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8be5842e-e9d5-4f18-90f6-545c2288eb9c">
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5866a844-b943-40f0-bdbe-1ccd88b0dec7">
      <name>СерийныеНомера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="94f0835b-0bc7-40b5-af7a-b49634e874d8">
      <name>Резерв</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="93c6f638-bc15-47b7-9268-7d8a77d4ca28">
      <name>Себестоимость</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="16492692-d666-4064-915d-c87d37cab732">
      <name>ЗаказПокупателя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="56d9e4e7-504d-473f-8b32-a333950aa29b">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АвторСтроки</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="31b17715-fded-490d-bd7b-902d2aa45fc0">
    <name>ИнвентарьИХозяйственныеПринадлежности</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b0376bce-8de0-4583-9d10-ca0a049ef9fa">
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8f0973ad-5d27-4511-9a5d-668155331f27">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9c9f1c41-0aa7-481c-8675-67bc901f11eb">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="32a7d162-bb4a-4a5a-8904-ba89fe9e80c0">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8aa09fac-5d52-484f-b4ee-a5a2a0108c13">
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f329d3fb-e7e1-4b98-a9f1-35c6e9481b66">
      <name>СтранаПроисхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7c0b7a0b-3fd8-41e2-88be-e39a8e868bf9">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="2bb02e54-8fce-4430-ba51-da10d5ade522">
    <name>Спецоснастка</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="476c7825-8781-4c26-9466-89f22a8ecc43">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="94a5c934-c13d-428d-b932-5af199cb6b96">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e865d647-d7e8-49fa-87af-2bf990f1dcc2">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f1126107-3afe-4141-a667-d32f47152247">
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="41873ec5-d568-4b6c-8906-2f1b46310515">
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="490a4e3d-72fd-43ff-bc05-fdcc0f29cbf1">
      <name>СтранаПроисхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3778f50d-bec4-44aa-aaa2-ab522191fdde">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

UNFCOPY.саУНФУправлениеАссортиментом/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e362a3ee-cbd4-427e-ba1c-135d2ac64280">
  <name>ФизическиеЛица</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="9e14912c-3e72-43a6-bcf4-596972af9386">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="ee926eaf-dc5a-412f-a8a8-70f96c93db4b">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="843462ec-1304-440c-adf1-20e04d768d76">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="07997f2a-265a-4e2e-8e3c-73bc062af70f">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7a19d270-211a-4ffd-aa88-992e3cc0a1d2">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

UNFCOPY.саУНФУправлениеАссортиментом/src/DataProcessors/ПечатьЛистаЗагрузки/ManagerModule.bsl
Функция ПредставлениеПФ()  Экспорт
		Возврат НСтр("ru = 'Лист загрузки'");		
КонецФункции

Функция КлючПараметровПечати()  Экспорт
	Возврат "ПАРАМЕТРЫ_ПЕЧАТИ_ЛистЗагрузки";
КонецФункции

Функция ПолныйПутьКМакету() Экспорт
	Возврат "Обработка.ПечатьЛистаЗагрузки.ПФ_MXL_ЛистСборки";
КонецФункции

Функция ИдентификаторПечатнойФормы() Экспорт
	
	Возврат  "ЛистЗагрузки";
	
КонецФункции

Функция ДанныеЛистаЗагрузки(МассивОбъектов)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Контрагент КАК ПредставлениеРеципиента,
		|	ЗаказПокупателя.АдресДоставки КАК АдресДоставки,
		|	ЗаказПокупателя.ПАК_МаршрутныйЛист.Номер КАК МаршрутныйЛистНомер,
		|	ЗаказПокупателя.Ссылка КАК Ссылка,
		|	ЗаказПокупателя.Номер КАК Номер,
		|	ЗаказПокупателя.Дата КАК Дата,
		|	ЗаказПокупателя.ФИОВодителя КАК Водитель,
		|	ЗаказПокупателя.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ЗаказПокупателя.ПАК_МаршрутныйЛист.Автомобиль КАК Автомобиль,
		|	ЗаказПокупателя.ПАК_МаршрутныйЛист.ЗонаТариф КАК ЗонаТариф,
		|	ЗаказПокупателя.ПАК_МаршрутныйЛист.ДатаЗагрузки КАК ДатаЗагрузки,
		|	ВЫРАЗИТЬ(ЗаказПокупателя.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
		|	""Заказ"" КАК ИмяДокумента
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Ссылка В(&МассивОбъектов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПеремещениеЗапасов.СтруктурнаяЕдиницаПолучатель,
		|	ПеремещениеЗапасов.АдресДоставки,
		|	ПеремещениеЗапасов.ПАК_МаршрутныйЛист.Номер,
		|	ПеремещениеЗапасов.Ссылка,
		|	ПеремещениеЗапасов.Номер,
		|	ПеремещениеЗапасов.Дата,
		|	ПеремещениеЗапасов.ФИОВодителя,
		|	ПеремещениеЗапасов.ДатаОтгрузки,
		|	ПеремещениеЗапасов.ПАК_МаршрутныйЛист.Автомобиль,
		|	ПеремещениеЗапасов.ПАК_МаршрутныйЛист.ЗонаТариф,
		|	ПеремещениеЗапасов.ПАК_МаршрутныйЛист.ДатаЗагрузки,
		|	ВЫРАЗИТЬ(ПеремещениеЗапасов.Комментарий КАК СТРОКА(1000)),
		|	""Перемещение""
		|ИЗ
		|	Документ.ПеремещениеЗапасов КАК ПеремещениеЗапасов
		|ГДЕ
		|	ПеремещениеЗапасов.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	АдресДоставки,
		|	ПредставлениеРеципиента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
		|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЗаказПокупателяЗапасы.Количество КАК Количество,
		|	ЗаказПокупателяЗапасы.Вес КАК Вес,
		|	Номенклатура2.КатегорияНоменклатуры КАК КатегорияНоменклатуры,
		|	ЗаказПокупателяЗапасы.Ссылка КАК Ссылка,
		|	ЗаказПокупателяЗапасы.Ссылка.Контрагент.Представление КАК Контрагент
		|ИЗ
		|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура2
		|		ПО ЗаказПокупателяЗапасы.Номенклатура = Номенклатура2.Ссылка
		|ГДЕ
		|	ЗаказПокупателяЗапасы.Ссылка В(&МассивОбъектов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПеремещениеЗапасов.Номенклатура,
		|	ПеремещениеЗапасов.ЕдиницаИзмерения,
		|	ПеремещениеЗапасов.Количество,
		|	&Вес,
		|	Номенклатура2.КатегорияНоменклатуры,
		|	ПеремещениеЗапасов.Ссылка,
		|	ПеремещениеЗапасов.Ссылка.СтруктурнаяЕдиницаПолучатель.Представление
		|ИЗ
		|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура2
		|		ПО ПеремещениеЗапасов.Номенклатура = Номенклатура2.Ссылка
		|ГДЕ
		|	ПеремещениеЗапасов.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент";
	
	
	Запрос.Текст=СтрЗаменить(Запрос.Текст,"&Вес","ПеремещениеЗапасов.Вес");
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Возврат  РезультатЗапроса;
	

КонецФункции // ()
 
Функция ПолучитьФИОКладовщика()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиПользователя.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_СОТР
		|ИЗ
		|	РегистрСведений.СотрудникиПользователя КАК СотрудникиПользователя
		|ГДЕ
		|	СотрудникиПользователя.Пользователь = &Пользователь
		|	И НЕ СотрудникиПользователя.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_СОТР.Сотрудник.Физлицо.Представление, """") КАК ФИО
		|ПОМЕСТИТЬ ВТ_ФЛ
		|ИЗ
		|	ВТ_СОТР КАК ВТ_СОТР
		|ГДЕ
		|	НЕ ВТ_СОТР.Сотрудник.Физлицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_ФЛ.ФИО КАК ФИО
		|ИЗ
		|	ВТ_ФЛ КАК ВТ_ФЛ";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
	        Возврат "";
	Иначе	
	      	Выборка = Результат.Выбрать();
          	Выборка.Следующий();
		 	Возврат ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Выборка.ФИО);

	КонецЕсли; 
	
КонецФункции // ()
 

Функция СформироватьПФ(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати)   Экспорт
	ФИОКладовщика =  ПолучитьФИОКладовщика();
	ТабличныйДокумент = ПечатнаяФорма.ТабличныйДокумент;
	
		
		ПолныйПутьКМакету	=	ПечатнаяФорма.ПолныйПутьКМакету;
		ПервыйДокумент = Истина;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы(ПолныйПутьКМакету);
		ДанныеЛистаЗагрузки =  ДанныеЛистаЗагрузки(МассивОбъектов);
		ВыборкаДокументов = ДанныеЛистаЗагрузки[0].Выбрать();
		ТабличнаяЧасть = ДанныеЛистаЗагрузки[1].Выгрузить();
				
		СтруктураПараметров = Новый Структура;
		Пока ВыборкаДокументов.Следующий() Цикл
			ТекущийДокумент = ВыборкаДокументов.Ссылка;
			
			Если НЕ ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаДокументов.Номер, Истина, Истина);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			СтруктураПараметров.Очистить();
			Шаблон = НСтр("ru = 'Лист загрузки по документу %1 №%2 от %3'");
			СтруктураПараметров.Вставить("ТекстЗаголовка", СтрШаблон(Шаблон, ВыборкаДокументов.ИмяДокумента, НомерДокумента,Формат(ВыборкаДокументов.ДатаОтгрузки, "ДЛФ=DD")));
			ОбластьМакета.Параметры.Заполнить(СтруктураПараметров);
			ОбластьМакета.Параметры.Водитель =  ВыборкаДокументов.Водитель;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			СтруктураПараметров.Очистить();
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			НомерСтроки=0;  ВсегоВес=0; ВсегоКоличество=0;
			СтруктураПоиска = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
			МассивВыборкаТабличныхЧ=ТабличнаяЧасть.НайтиСтроки(СтруктураПоиска);
			Для каждого ВыборкаТабличныхЧ Из МассивВыборкаТабличныхЧ Цикл
				    НомерСтроки=НомерСтроки+1;
					ВсегоВес=ВсегоВес+ВыборкаТабличныхЧ.Вес;
					ВсегоКоличество=ВсегоКоличество+ВыборкаТабличныхЧ.Количество;

					КодНоменклатуры =   ВыборкаТабличныхЧ.Номенклатура.Код;
					Попытка
					      КодНоменклатурыЧ = ЧИСЛО(ПРАВ(КодНоменклатуры,8));
					Исключение
					      КодНоменклатурыЧ = КодНоменклатуры;
					КонецПопытки;
					
										
					ОбластьМакета.Параметры.Заполнить(ВыборкаТабличныхЧ);
					ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
					ОбластьМакета.Параметры.Код = КодНоменклатурыЧ;
					ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЦикла; 
			

			ОбластьМакета = Макет.ПолучитьОбласть("Итого");
			ОбластьМакета.Параметры.ВсегоВес = ВсегоВес;
			ОбластьМакета.Параметры.ВсегоКоличество = ВсегоКоличество;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Ответственный");
			Ответственный	=	"";
			Если ТипЗнч(ТекущийДокумент)=Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
			    ОбластьМакета.Параметры.Ответственный= ТекущийДокумент.Автор.Наименование;
			ИначеЕсли ТипЗнч(ТекущийДокумент)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
	             ОбластьМакета.Параметры.Ответственный= ТекущийДокумент.Ответственный.Наименование;
			КонецЕсли; 
			ТабличныйДокумент.Вывести(ОбластьМакета);
			//ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			//ОбластьМакета.Параметры.ФИОКладовщика = ФИОКладовщика;
			//ТабличныйДокумент.Вывести(ОбластьМакета);

			КонецЦикла;
		
	
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции
